In [20]:
import pandas as pd
import numpy as np
from pandas import DataFrame as df
from pandas import Series as s

In [21]:
dl = {'States':['Kerala','TN','Bihar'],'Population':[1879,1678,1987],'Suicides':[56,12,34]}

In [22]:
dldf = df(dl)

In [23]:
add_col = [13.4,23.5,20.9]

In [24]:
dldf['Crime-rate'] = add_col
dldf

   Population  States  Suicides  Crime-rate
0        1879  Kerala        56        13.4
1        1678      TN        12        23.5
2        1987   Bihar        34        20.9

In [49]:
ser = s('1000,1200,9000,9500,9750'.split(","))
sdf = df(ser)
sdf.name = 'NAME'
sdf = df(sdf)
sdf

      0
0  1000
1  1200
2  9000
3  9500
4  9750